# IsByComponent Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Stairs..::..IsByComponent Method
Stairs Class See Also
---
Indicates if the stairs is created by stairs components(runs, landings and supports).
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static bool IsByComponent(
	Document document,
	ElementId stairsId
)
```

Visual Basic
---
```text
Public Shared Function IsByComponent ( _
	document As Document, _
	stairsId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsByComponent(
	Document^ document,
	ElementId^ stairsId
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document.
stairsId
    Type: Autodesk.Revit.DB..::..ElementId The stairs element to check.
# ### Return Value
True if the stairs is created by components, False otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The element stairsId does not exist in the document |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Stairs Class
Autodesk.Revit.DB.Architecture Namespace